Ran Plan for dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gcompute-engine.google_compute_instance.instance will be updated in-place
~ resource "google_compute_instance" "instance" {
        id                   = "projects/onlineshop-378118/zones/asia-southeast2-a/instances/ols-dev-gce-atlantis"
      ~ metadata             = {
          ~ "ssh-keys" = <<-EOT
                atlantis:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDUM5S9AHYwHg1TkDOx6YKz3kZZEu9t0xOs2UumhH4gHqJxMni3R9SL8Uym84Pbd3W/Qpkf31JjkkeLdjujNBZWDtVZH4/OHR2i1X7DlLtphEzW0Cdcs2ngGBjmisX0z0BJjElEEc6X+7XNOp80CTl+XNJxlHSciRes3xnqGpIImZrMSUbjf7FJGu3SXQ6DD+rNXv6nTH0MYgGWVQeVjIxSPPyqSA2eY1q2rbkvYfePV/3ZQxOl+GZuXLgDAX1dkp8tdymZqhayk2bnZ1xsE9ooCmsPgisEd+hgJPfaR7U7yJxNgbuqxjKapEeqV1MDbpBvQ9BW/wKmGSo1xesYpLiR
              - imam_arief_rhmn:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBCwziSDAB25P8vAyBHeNyFahR/sARJagj0g/Hvk1RmowZ/2qM59+lx6DDfNGnB3dyUgWLHen6wj8zSvYYkFT4ww= google-ssh {"userName":"imam.arief.rhmn@gmail.com","expireOn":"2023-08-22T14:17:10+0000"}
              - imam_arief_rhmn:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCKF5DjjgkykPU0ntPBJSLRe++F2qnwz9JjK4MePltqEljW2xWnE1dJIaYVR1PuPIZ4RX/09uLgXkCTjWtaS/So0WlMAJ630ibLSEtlCE0Mxq0YVdwl1IaBHAvpmmC3bslXsVhh2c5WqtXV3m3LuICIiYOAGksnzyaRB9Do/zqdgbV0avvBCEKJ7PPCsilIODlT5ZaxfdYBbBgB+Xm9zbfdRNVPsy0qV+qCtoE1ZoUnUczBgXD9ZzoWvqQUVjajvccJbLiujrFkGj1K1IgKtu3ZSBZlzQtHXJPYrOnLNTTRiTs4vXfHK6GesHhgYwC83QC+8odKlknY75St87ViIMkz google-ssh {"userName":"imam.arief.rhmn@gmail.com","expireOn":"2023-08-22T14:17:24+0000"}
            EOT
        }
        name                 = "ols-dev-gce-atlantis"
        tags                 = [
            "atlantis",
        ]
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gcompute-engine.local_file.ansible_vars[0] will be created
+ resource "local_file" "ansible_vars" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ansible_vars.json"
      + id                   = (known after apply)
    }

  # module.gcompute-engine.local_file.private_key will be created
+ resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "id_rsa.pem"
      + id                   = (known after apply)
    }

  # module.gcompute-engine.null_resource.ansible_playbook[0] must be replaced
-/+ resource "null_resource" "ansible_playbook" {
      ~ id       = "4512382264145240437" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "playbook_checksum" = "6e26ac0c3de6458ed6bc2bc56d24b738f4e5d607bd8a75de0b284e51cfee3f13" -> "0d73d98c8efb6d6a75e376855df98f9ed7ae399c1d30f59442a9226bbe5e8d6b"
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgcompute-engine-atlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis`
</details>
Plan: 3 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`